app/Controllers/Auth.php

    public function store()
    {
        $rules = [
            'name'            => 'required',
            'email'           => 'required|valid_email',
            'password'        => 'required',
            'confirmpassword' => 'matches[password]'
        ];

        if($this->validate($rules)){
            $user = new Users();
            $data = [
                'name'     => $this->request->getVar('name'),
                'email'    => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];

            $user->save($data);
---
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Ajajul Ansari', 'ajajul@gmail.com', '$2y$10$t0gMUpNDNwGiqqAg7ftfsuKGxFK3cvCFN8EjZITacUkeHdNgPXavm')

    public function loginAuth()
    {
        $session = session();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = new Users();
        $data = $user->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'ajajul@gmail.com'
 LIMIT 1