app/Controllers/Home.php

    function school() {

        $pager   = \Config\Services::pager();
        $schools = new Schools();
        $search  = "";

        if($this->request->getVar('search')){
           $search   = $this->request->getVar('search');
           $paginate = $schools->select('*')->orLike('name', $search)->orLike('location', $search)->paginate(10);
        } else {
            $paginate = $schools->paginate(10);
---
SELECT *
FROM `schools`
WHERE `name` LIKE '%Wikibox%' ESCAPE '!'
OR  `location` LIKE '%Wikibox%' ESCAPE '!'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `schools`
WHERE `name` LIKE '%Wikibox%' ESCAPE '!'
OR  `location` LIKE '%Wikibox%' ESCAPE '!'
SELECT *
FROM `schools`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `schools`